simple/src/Documents/SalesInvoice/SalesInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SalesInvoice</name>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

simple/src/Documents/SalesInvoice/Forms/ФормаДокумента/Module.bsl
#Region FormHeaderItemsEventHandlers

&AtClient
Procedure QuantityOnChange(Item)
	
	CalculateAmount( );
	
EndProcedure

&AtClient
Procedure PriceOnChange(Item)
	
	CalculateAmount( );
	
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure CalculateAmount( )
	
	Object.Amount = Object.Quantity * Object.Price;
	
EndProcedure

#EndRegion
